# PipingViscosity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PipingViscosity Property
SpecTypeId Class See Also
---
Dynamic Viscosity, in discipline Piping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PipingViscosity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipingViscosity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipingViscosity {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace